Repository: eugeneai/bash-essentials-ru-handbok
Catalog: tmx/en-ru-level2.tmx
Source language: en
Languages: ru

source: This is achieved using a powerful knowledge base, as well as the use of special procedures and proof strategies.
ru: Это достигается с помощью мощной базы знаний, а также использованием специальных процедур и стратегий доказательства.

source: This is an overly simplified explanation, but you can read more here if you’re curious.
ru: Это, конечно, слишком упрощенное объяснение, и подробнее тему можно изучить здесь, если вам стало интересно.

source: This is generally not a problem on Linux, but on Mac, you will need to alter a few of the default settings.
ru: Обычно это не проблема для Linux, но на Mac нужно будет изменить некоторые настройки по умолчанию.

source: This is great, but what if we modified the text file so it looked like this:
ru: Замечательно, но что будет, если изменить текстовый файл так, чтобы он выглядел так:

source: This is not just a bash command but an entire program that has extensive capabilities.
ru: Программа top - это не просто команда bash, она имеет свои собственные обширные возможности.

source: This is not the case.
ru: Но это не наш случай

source: This is okay because my request I sent has the current IP address for my home network and therefore the server sending back the information will find my network.
ru: Это нормально, потому что отосланный запрос имеет текущий IP-адрес домашней сети, и поэтому сервер, отправляющий информацию, найдет эту сеть.

source: This is opposite of the ^ character that we just learned about.
ru: Символ $ противоположен свойствами ^, представленный ранее.

source: This is probably due to the complexity of the theoretical representation of such approach.
ru: Это, наверное, из-за сложности теоретического представления такого подхода.

source: This is similar to reading arguments, but instead of the user typing their input in before execution time, they type it in during execution.
ru: Это похоже на чтение аргументов из командной строки, но данные (значения переменных) вводятся пользователем во времени выполнения программы.

source: This is the systemd init script.
ru: В современных дистрибутивах этот скрипт находится в пакете systemd.

source: This is the most basic form of a script, but obviously not all that useful.
ru: Приведенный пример рабочий, но, очевидно, бесполезен.

source: This is the user space version of priority and is directly related to priority (PR) by the following formula: PR = 20 + NI.
ru: Реальный приоритет пользовательского процесса состоит из приоритета (PR), вычисляемый по формуле PR = 20 + NI.

source: This is the variable that tells the bash shell where to find different executable files and scripts.
ru: Она сообщает оболочке bash, где искать исполняемые файлы и сценарии.

source: This is trivial and unexciting.
ru: Это слишком просто и неинтересно.

source: This is useful because we get to see our computer in real time.
ru: Таким образм мы получаем информацию о состоянии компьютера в реальном времени.

source: This is where an understanding of IP addresses and subnetting on a LAN is helpful, because the INET address listed is not actually the public IP address recognized by the broader internet.
ru: Вот где понимание IP-адресов и подсетей в локальной сети полезно, потому что указанный адрес INET на самом деле не является общедоступным IP-адресом, распознаваемым маршрутизаторами Интернета.

source: This is where the Domain Name System (DNS) comes in.
ru: Здесь на помощь приходит система доменных имен (DNS).

source: This is where the modem comes in.
ru: Вот где используется устройство-модем.

source: This line will be more helpful to us when we are filtered by a specific process later.
ru: Данные этой строки будут полезны когда будем отфильтровать процессы.

source: This makes up the internet, and is ported into your home through telephone wires, underground cables, or satellite.
ru: Это составляет Интернет, и он поставляется в дом через телефонные провода, подземные кабели или спутник.

source: This means that every time you want to login to your VM, you will have to add the ssh key.
ru: Каждый раз, когда надо подключиться к виртуальной машине, нужно будет добавлять ключ ssh.

source: This method has proven itself in many applications and has been widely recognized.
ru: Этот метод зарекомендовал себя во многих приложениях и получил широкое признание.

source: This object is constructed from the set of visual models using SysML diagrams (State diagrams, Parametric diagram, Requirement diagram, etc.).
ru: Этот объект строится из набора визуальных моделей SysML (State diagrams, Parametric diagram, Requirement diagram и т.д.).

source: This project proposes an inference-based semantic interpretation algorithm (SIA) as a universal cross-context semantic parsing strategy.
ru: Данный проект предполагает использорвать алгоритм семантической интерпретации (АСВ), построенный на основе логического вывода, в качестве универсальной стратегии семантического анализа с кросс-контексте.

source: This regex will match the entire line that ends in a question mark because we are using the $ symbol, which represents the end of the line.
ru: В данном примере шаблон соответствует тексту всей строки. В шаблоне конец строки обозначен вопросительным знаком (часть искомой строки) и специальным символом "$".

source: This regular expression will match just the area code of the first phone number.
ru: Это регулярное выражение будет соответствовать только коду города первого телефонного номера.

source: This representation allows one to create modularized knowledge bases applicable in applied research.
ru: Это представление позволяет создавать модульные баз знаний, применяемые в прикладных исследованиях.

source: This root database will know where thediygolfer.com is because I registered it with an official registrar called NameSilo.
ru: Корневой базе данных известно, где нахдится thediygolfer.com потому, что но зарегистрирован у официального регистратора NameSilo.

source: This script will evaluate to - “The script ./shell-scripting-basics.sh evaluates to: 12”
ru: Данный скрипт вычисляется в “Скрипт ./shell-scripting-basics.sh вычисляется в: 12”

source: This should successfully log you into your VPS.
ru: Эта команда должна подключить текущий терминал к новому VPS.

source: This stage is based on construction of a classifications and assignment of the readings to the classes.
ru: Этот этап основан на построении таксономии и отнесении прочтений к таксонам (классам).

source: This stage is mandatory, and the amount of rejected sequences must be evaluated.
ru: Этот этап является обязательным: необходимо оценить количество отклоненных последовательностей.

source: This topic can get quite loaded, and therefore I am not going to dig too deep into it.
ru: Эта тема может довольно обширна, поэтому, как и прежде, не будем сильно углубляться.

source: This topic is impossible to understand without an understanding of subnetting, so I have written a separate post to explain it for anyone looking to more deeply understand what is going on.
ru: Эту тему невозможно понять без усвоения сетевых технологий. Для более глубокого усвоения темы есть отдельный пост, который предназначен тем, кому интересно.

source: This transformation supplies uniform access to all model structures of all models simultaneously.
ru: Такая трансформация обеспечивает единообразный доступ к структурам всех моделей одновременно.

source: This type of masking is only encouraged for deep-level phylogenetic analysis, not fine level analysis such as that needed with calculating OTUs.
ru: Этот тип маскировкирования рекомендуется только для филогенетического анализа глубокого уровня, а не для обычного анализа с вычислением над экземплярами OTU.

source: This variable will not be available to any script until we export it and make it an environment variable.
ru: Эта переменная не будет доступна ни одному сценарию, пока не будет экспортирована и не сделана переменной среды.

source: This will add the /home/zach/script-location directory to the beginning of the PATH variable.
ru: Команда добавляет директорий /home/zach/script-location в начало списка PATH.

source: This will allow us to understand the components that go into it.
ru: Это позволит понять компоненты, составляющие технологии.

source: This will ask you what directory to store the key in.
ru: Будет задан вопрос о каталоге, где будет храниться ключ.

source: This will be relevant if we transit to a heterogenic software NGS data processing platform.
ru: Преобразование станет актуальным, если надо будет переходить на гетерогенную программную платформу обработки данных NGS.

source: This will download the photo and save it as my-custom-picture.jpg in whatever directory I execute the command from.
ru: В результате фотография будет загружена и сохранена под именем my-custom-picture.jpg каком-либо каталоге, из которого потом потребуется выполнять какие-либо команду.

source: This will drop you into a help page that gives you hints on how to use the program.
ru: В результате будет показана страница справки, направляющая пользователя по функциям программы.

source: This will eliminate that invalid email address!
ru: Последнее изменение устраняет неверные адреса электронной почты!

source: This will enrich existing techniques, which already support parallel processing; as compared to the resolutional method, less combinatorial inference search process, weak requirements of the formula structure, highly configurable and compatible with heuristics.
ru: Это обогатит существующие методики, которые уже поддерживают параллельную обработку; по сравнению с методом резолюции, наш метод имеет менее комбинаторный процесс поиска логического вывода, более слабые требования к структуре формулы, логический вывод настраиваемый и совместимый с эвристиками.

source: This will give you an output at the top of your screen that says something like scroll coordinates: y = 13/345 (tasks), x = 1/12 (fields).
ru: В результате в верхней части экрана будет показано что-то вроде scroll coordinates: y = 13/345 (tasks), x = 1/12 (fields).

source: This will give you that terminal’s list of jobs.
ru: В результате получите список заданий для данного терминала.

source: This will incorporate the find command that we learned earlier!
ru: Скрипт будет использовать команду find, которую изучили ранее!

source: This will just print the A record for my site in a short format.
ru: В результате просто будет напечатана запись A для сайта в коротком формате.

source: This will not read the variable: $MY_VARIABLE'
ru: Значения переменной $MY_VARIABLE не будет отображено'

source: This will open the top program and set the interval to 10 seconds.
ru: При этом в top будет установлен интервал 10 секунд.

source: This will place that same sample file into my local computer’s ~/Downloads folder.
ru: Загруженный файл будет помещен в папку ~/Downloads локального компьютера.

source: This will print the output of the sed transformation.
ru: Будет распечатан результат преобразования из sed.

source: This will print “2 does equal 2” because the expression evaluates to true (a 0 exit code).
ru: Будет напечатано «2 действительно равно 2» потому, что выражение истинно (код выхода 0).

source: This will run the google-chrome executable (opens a Google Chrome window) and track how much real, user, and system time was used for that executable.
ru: Это запустит Гугл Хром исполняемый файл (открывает окно Google Chrome) и отслеживает, сколько реального, пользовательского и системного времени было использовано для этого исполняемого файла.

source: This will send the default SIGINT kill signal to the process.
ru: По умолчанию процессу будет послан сигнал SIGINT.

source: This will start the Remote server.
ru: Это запустит удаленный сервер.

source: This will upload the sample-file.txt file using the root user and place that file in the home directory ~/ on my remote machine.
ru: В результате файл sample-file.txt будет загружен, используя пользователя root, файл будет помещени в домашний каталог ~/ на уделенной машине.

source: Those that are within the threshold are merged with the larger sequence.
ru: Те, что находятся вблизи порога, добавляются к последовательностям, содержащимся в большем количестве.

source: Throughout this section, we will learn the most important components of a bash script, which includes:
ru: В этом разделе приведем наиболее важные компоненты сценария bash, включая

source: Throughout this tutorial, we have covered many commands and concepts.
ru: В этом руководстве рассмотрено много команд и концепций.

source: Thus, the control is synthesized by means of logic controlled computer simulation.
ru: Таким образом, управление синтезируется при помощи имитационного моделирования, управляемого логиким выводом.

source: To avoid doing this every time you login to your Mac, you will need to modify ~/.ssh/config to have the following entry:
ru: Чтобы избежать таких повторений при входе в систему Mac нужно будет изменить ~/.ssh/config и добавить следующую запись:

source: To be more concrete in the further reasoning, we will briefly describe MiSeq SOP implemented with Mothur software [4].
ru: Чтобы быть более конкретным в дальнейших рассуждениях, мы кратко опишем MiSeq SOP, реализованный с помощью программного обеспечения Mothur [4].

source: To change what fields are displayed, you can type f to enter the field manager.
ru: Чтобы изменить перечень полей, надо нажать f, что откроет менеджер отображаемых полей.

source: To create a local environment variable, just export it in your shell.
ru: Чтобы создать сеансовую переменную среды надо export-ировать ее в текущую оболочку.

source: To do this, go to the terminal where Google Chrome has stopped and type the command jobs.
ru: Для этого перейдите в терминал, на котором находится остановленный Google Chrome, и введите команду jobs.

source: To do this, open VSCode, and download the extension called “Remote VSCode”.
ru: Для включения этой функции откройте в VSCode и загрузите расширение (extension) под названием «Remote VSCode».

source: To do this, we can add the ANY option.
ru: Для этого можно добавить опцию ANY.

source: To do this, we can use either *, +, ?, or {}.
ru: Для этого используются специальные символы *, +, ? и {}.

source: To do this, we use the scp utility.
ru: Для этого используется утилита scp.

source: To download that same file from your remote machine to your local computer, you would just run the following.
ru: Чтобы загрузить файл с удаленного компьютера на локальный надо запустить следующую команду.

source: To escape a special character, we use the backslash right before it).
ru: Чтобы экранировать специальный символ, используется обратная косая черта непосредственно перед экранируемым символом).

source: To fix this, we modify the regular expressions one more time.
ru: Чтобы исправить это, модифицируем еще раз выражения.

source: To get that process ID, we can run the ps command (more on this later).
ru: Чтобы получить этот идентификатор, надо запустить команду ps (подробнее об этом позже).

source: To get that, I can use awk.
ru: Для выделения этих столбщов используем awk.

source: To go back a window, press b
ru: Чтобы пролистать на страницу вверх, жмите b

source: To go forward an entire window, type f or spacebar
ru: Для продвижения вниз на страницу, жмите f или "пробел"

source: To go to beginning of file, press g
ru: Чтобы перейти к началу файла, жмите g

source: To go to end of file, press G
ru: Чтобы перейти в конец файла, жмите G

source: To learn what the command above means, let’s write it into a file for greater clarity.
ru: Чтобы узнать, что означает вышеупомяшная команда, сохраним ее в файл, что удобнее для обучения.

source: To make sense of the commands were are about to run, we need to have at least a foundational understanding of the following.
ru: Чтобы разобраться в командах, которые далее будут запускаться, нужно иметь хотя бы базовое понимание сетевых технологий.

source: To me, regular expressions are often made far more complicated than they need to be.
ru: Есть мнение, что язык регулярных выражений сложнее, чем он должнен быть.

source: To move commands to a different location in the menu, highlight one, press the right arrow key to highlight the entire field, and then press up and down arrow keys until you have placed it where you want it.
ru: Чтобы переместить команду на новое место в меню надо ее выделить при помощи клавиши "вправо", далее, при помощи стрелок "вверх" и "вниз" производится размещение поля по вашему желанию.

source: To perform the analysis, significant computational resources are required, as well as bioinformatics skills for analysis and interpretation.
ru: Для выполнения анализа требуются значительные вычислительные ресурсы, а также навыки биоинформатики для анализа и интерпретации.

source: To recap, we are matching “You” at the beginning of the line (^), then we are matching 1 or more of any character after that (.+), and finally we are matching “is” at the end of the line ($).
ru: Что имеем теперь: сопоставляем “You” в начале строки (^), затем 1 или больше любых символов (.+) и в конце сопоставляем “is” в конце строки ($).

source: To reduce the output that we see, we can add the +noall flag and +answer flag to reduce all output and only see the answer section.
ru: Чтобы сократить результат, можно добавить флаги +noall и +answer, т.е. показывать только раздел ответов.

source: To run this, we can do so in two ways.
ru: Заапуск скрипта осуществляется двумя способами.

source: To scroll down a line, press j (like vim)
ru: Для прокурутки на одну линию вниз, жмите j (как в vim)

source: To scroll up a line, press k (like vim)
ru: Для прокрутки на одну строку, жмите k (как в vim)

source: To search for “some text”, type /some text (to search forward) or `?
ru: Для поиска "текста", наберите /текст (поиск по тексту вниз) или '?

source: To see all of the environment variables in your current environment (both local and global), you can type the following command.
ru: Чтобы увидеть все переменные текущего сеанса (как локальные, так и глобальные), можно запустить команду

source: To see what coordinates you are at in the output, just type C.
ru: Чтобы сориентироваться в тексте, введите C.

source: Transformation software is constructed as logical objects [3].
ru: Программное обеспечение трансформации строится в виде логических объектов [3].

source: Transformation technologies are presented with popular ATL (ATLAS Transformation language, Jouault F., Kurtev I. (2006) Transforming Models with ATL.
ru: Технологии трансформации моделей представлены популярной технологий ATL (ATLAS Transformation language, Jouault F., Kurtev I. (2006) Transforming Models with ATL.

source: Transition from PIM to PSM (a model transformation) is carried out by means of logical inference of the PSM properties on the base of facts representing PIM and the properties of the implementation platform, a Platform Model (PM), in our case it is Java programming language.
ru: Переход от PIM к PSM (трансформация модели) осуществляется при помощи логического вывода свойств PSM на основе фактов, представляющих PIM, и свойств платформы реализации, модели платформы (PM), в нашем случае это язык программирования Java.

source: Trapeznikov Institute of Control Sciences, Russian Academy of Sciences, Moscow Russia, Laboratory of Intellectual control systems and modelling (10 papers per year);
ru: Институт проблем управления РАН, Российская академия наук, Москва, Лаборатория интеллектуальных систем управления и моделирования (публикует по 10 статей в год);

source: Type PID=22435 and press Enter
ru: Надо набрать PID=22435 и нажать Enter

source: Type c to toggle between the full name and abbreviated name.
ru: Нажатие c меняет режим отображения между полным наименованием и его сокращенным вариантом.

source: Type ifconfig in your terminal, and you should get the following output.
ru: Наберите ifconfig в терминале, в результате получится результат, похожий на следующий.

source: Type h and you will receive a help panel with all the possible commands you can run.
ru: Нажатие h открывает панель помощи, где отображаются все возможные интерактивные команды.

source: Type the letter O (uppercase) in interactive mode
ru: Нажмите букву O (верхний регистр) в интерактивном режиме

source: UGENE primary visualizes workflow and gene data.
ru: UGENE визуализирует рабочий процесс и данные о геноме.

source: USER - user ID that owns the process
ru: USER - Идентификатор пользователя, владеющего процессом

source: Ultimately, each awk command is a series of keywords and outputs.
ru: В конечном счете, каждая awk команда есть наборы ключевых слов и команд формирования выходных данных.

source: Uncertainties are expressed as possible competing agent actions and probabilistic events occurring internally in the system.
ru: Неопределенности выражаются в виде возможных действий конкурентных агентов и вероятностных событий, происходящих внутри системы.

source: Uncertainties were modeled by reassigning tasks between machines, changing order of task execution.
ru: Неопределенность моделируется перераспределением задач между машинами, изменением порядка выполнения задач.

source: Unfortunately, this isn’t going to work either.
ru: К сожалению, это тоже не сработает.

source: Unless you are a system management wizard, some of these default fields are not going to be that useful to you.
ru: Мастера управления системой могут извлечь больше полезной информации из значений других полей.

source: Unless you are an admin configuring networks on a daily basis, you will never need to use these tools to edit settings.
ru: Если вы не собираетесь быть администратором, настраивающим сети каждый божий день, вам никогда не понадобится использовать эти инструменты для редактирования настроек.

source: Unlike other systems, the verification process in the system is automatic.
ru: В отличие от других систем, процесс проверки в системе происходит автоматически.

source: Unlike the ps command, we will never need to re-type the top command because all our configurations can be done within the program itself.
ru: В отличие от команды ps, top не требует повторного ввода в командной строке top с новыми флагами потому, что все настройки делаются в самой программе.

source: Unshielded twisted pair (UTP) cables (100 Mhz)
ru: Кабели неэкранированной витой пары (UTP, 100 МГц)

source: Usage of such kind of transformation approach allows us to develop software system carcasses on the level of abstract models, involve various sources of model data in the transformation, define and structuring conversion knowledge as objects.
ru: Использование такого подхода к трансформации позволяет разрабатывать каркасы программного обеспечения на уровне абстрактных моделей, вовлекать различные источники модельных данных в процесс трансформации, определять и структурировать трансформационные знания в виде объектов.

source: Usage of the ontologies allowed us to direct the research “along known spaces” of metadata and use the experience of the designers of ontologies, narrow the search space of the solutions.
ru: Использование онтологий позволило направить исследование «по известным пространствам» метаданных и, используя опыт разработчиков онтологий, сузить пространство поиска решений.

source: Used approach allowed us to solve many technical problems, including providing our dataflow visualization tools with actual set of Mothur commands, implementing an abstract engine of Mothur command properties mapping to a software environment.
ru: Используемый подход позволил нам решить множество технических проблем, в том числе снабдить наши инструменты визуализации потока данных актуальным набором команд Mothur, реализовать абстрактный механизм отображения свойств команд Mothur в программную среду.
